# panda
* filter
* sorting
* groupby
* mergr
* useful method

In [36]:
import pandas as pd
from datetime import datetime

student_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'Physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'Physics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'Physics', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'Art', 'date_of_admission': '2023-10-05', 'fee': 19000},
]

# Create the DataFrame
students_df : pd.DataFrame = pd.DataFrame(student_data)

# Convert 'data_ofadmission' to datetime
students_df['date_of_admission'] = pd.to_datetime(students_df['date_of_admission'])

# Show the dataframe
display(students_df)

# Verify the data types
print(students_df.dtypes)

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    Physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

roll_no                       int64
name                         object
father                       object
course                       object
date_of_admission    datetime64[ns]
fee                           int64
dtype: object

# apply the filter or filter functions on dataframe

In [8]:
students_df.head(1)

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000

In [9]:
# course.value_counts() kitni dfa kon sa course prha ja rha h physic 3 dfa or baki sb 1 dfa
# course.value_counts ksi b column pe lgya ja skta h
students_df.course.value_counts()

course
Physics      3
Chemistry    1
Biology      1
Economic     1
History      1
Geography    1
English      1
Art          1
Name: count, dtype: int64

In [10]:
# also count null cell values(khali cell b btae ga )

students_df.course.value_counts(dropna=False)

course
Physics      3
Chemistry    1
Biology      1
Economic     1
History      1
Geography    1
English      1
Art          1
Name: count, dtype: int64

In [12]:
# percentage mai btae ga kitne percent kon sa course hm krwa rhe hai

students_df.course.value_counts(dropna=False,normalize=True)

course
Physics      0.3
Chemistry    0.1
Biology      0.1
Economic     0.1
History      0.1
Geography    0.1
English      0.1
Art          0.1
Name: proportion, dtype: float64

In [13]:
students_df.course.value_counts(dropna=False,normalize=True)*100

course
Physics      30.0
Chemistry    10.0
Biology      10.0
Economic     10.0
History      10.0
Geography    10.0
English      10.0
Art          10.0
Name: proportion, dtype: float64

In [14]:
students_df

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    Physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom   Economic        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

In [18]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

# Set a seed for reproducibility
np.random.seed(0)

# Define the number of transactions
num_transactions = 1000

# Generate random dates within the current year
current_year = datetime.now().year
start_date = datetime(current_year, 1, 1)
end_date = datetime.now()

# Generate a list of random dates within the year
random_dates = [start_date + timedelta(days=np. random. randint(0, (end_date - start_date).days))
for _ in range(num_transactions)]


# Generate a list of random fee amounts
random_fees = np.random.randint(low=1, high=5000, size=num_transactions)

# Create the DataFrame
fee_transactions = pd.DataFrame({
'date': random_dates,
'fee': random_fees
})
# Sort by date for readability
fee_transactions.sort_values('date', inplace=True)


# Reset index after sorting
fee_transactions.reset_index(drop=True, inplace=True)

print(fee_transactions)

          date   fee
0   2023-01-01  1194
1   2023-01-01  4525
2   2023-01-01  2404
3   2023-01-01  1544
4   2023-01-03  3878
..         ...   ...
995 2023-11-30  3533
996 2023-12-01  3467
997 2023-12-01   581
998 2023-12-01  1796
999 2023-12-01  4200

[1000 rows x 2 columns]

In [19]:
pd.cut(fee_transactions.fee,[1,500,1000,3000,4000,5000])

0      (1000, 3000]
1      (4000, 5000]
2      (1000, 3000]
3      (1000, 3000]
4      (3000, 4000]
           ...
995    (3000, 4000]
996    (3000, 4000]
997     (500, 1000]
998    (1000, 3000]
999    (4000, 5000]
Name: fee, Length: 1000, dtype: category
Categories (5, interval[int64, right]): [(1, 500] < (500, 1000] < (1000, 3000] < (3000, 4000] < (4000, 5000]]

In [20]:
# kis count ya slab k transcution zyda ho ri hai

pd.cut(fee_transactions.fee,[1,500,1000,3000,4000,5000]).value_counts()

fee
(1000, 3000]    422
(3000, 4000]    199
(4000, 5000]    197
(1, 500]        108
(500, 1000]      74
Name: count, dtype: int64

In [22]:
pd.cut(fee_transactions.fee,[1,500,1000,3000,4000,5000]).value_counts(normalize=True)*100

fee
(1000, 3000]    42.2
(3000, 4000]    19.9
(4000, 5000]    19.7
(1, 500]        10.8
(500, 1000]      7.4
Name: proportion, dtype: float64

In [23]:
pd.qcut(fee_transactions.fee,[0.3,0.5,0.7,0.9,1])

0                     NaN
1        (4461.7, 4998.0]
2      (1546.999, 2432.0]
3                     NaN
4        (3552.4, 4461.7]
              ...
995      (2432.0, 3552.4]
996      (2432.0, 3552.4]
997                   NaN
998    (1546.999, 2432.0]
999      (3552.4, 4461.7]
Name: fee, Length: 1000, dtype: category
Categories (4, interval[float64, right]): [(1546.999, 2432.0] < (2432.0, 3552.4] < (3552.4, 4461.7] < (4461.7, 4998.0]]

In [25]:
pd.qcut(fee_transactions.fee,[0,0.3,0.5,0.7,0.9,1]).value_counts()

fee
(13.999, 1547.0]    301
(2432.0, 3552.4]    200
(3552.4, 4461.7]    200
(1547.0, 2432.0]    199
(4461.7, 4998.0]    100
Name: count, dtype: int64

In [26]:
pd.qcut(fee_transactions.fee,[0,0.3,0.5,0.7,0.9,1]).value_counts(normalize=True)*100

fee
(13.999, 1547.0]    30.1
(2432.0, 3552.4]    20.0
(3552.4, 4461.7]    20.0
(1547.0, 2432.0]    19.9
(4461.7, 4998.0]    10.0
Name: proportion, dtype: float64

In [28]:
students_df.head()

   roll_no   name father     course date_of_admission    fee
0        1  Alice    Bob    Physics        2023-01-10  10000
1        2  Brian  Steve  Chemistry        2023-02-12  11000
2        3  Chloe    Tim    Biology        2023-03-14  12000
3        4  David   Rick    Physics        2023-04-10  13000
4        5    Eva   John    Physics        2023-05-16  14000

# filter on columns

* & , | , ~
syntex:```
dataframe[(dataframe.column1=='value1') & (dataframe.column2=='value2)]
```

* string columns
* numeric columns
* datatime columns

In [29]:
students_df.head(10)

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    Physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom   Economic        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

In [32]:
# akela koi ak subject niklna ho jse k physic niklna h to 

students_df[students_df['course']=='Physics']

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000
3        4  David   Rick  Physics        2023-04-10  13000
4        5    Eva   John  Physics        2023-05-16  14000

In [37]:
# jha jha cs likha ho ga wo sb le ae ga
students_df[students_df['course'].str.lower().str.contains('cs')]

   roll_no   name father     course date_of_admission    fee
0        1  Alice    Bob    Physics        2023-01-10  10000
3        4  David   Rick    Physics        2023-04-10  13000
4        5    Eva   John    Physics        2023-05-16  14000
5        6  Frank    Tom  Economics        2023-06-21  15000

In [38]:
# use multiple filters
students_df[(students_df['course'].str.lower().str.contains('cs')) & (students_df['fee']>=14000)]

   roll_no   name father     course date_of_admission    fee
4        5    Eva   John    Physics        2023-05-16  14000
5        6  Frank    Tom  Economics        2023-06-21  15000

In [39]:
students_df[students_df['course'].str.lower().str.contains("cs") | students_df['course'].str.lower().str.contains("r")]

   roll_no   name   father     course date_of_admission    fee
0        1  Alice      Bob    Physics        2023-01-10  10000
1        2  Brian    Steve  Chemistry        2023-02-12  11000
3        4  David     Rick    Physics        2023-04-10  13000
4        5    Eva     John    Physics        2023-05-16  14000
5        6  Frank      Tom  Economics        2023-06-21  15000
6        7  Grace    Harry    History        2023-07-25  16000
7        8  Henry  Charles  Geography        2023-08-17  17000
9       10   Jack     Noah        Art        2023-10-05  19000

# apply filter on data column
* dataframe.column.dt

In [41]:
students_df['date_of_admission']

0   2023-01-10
1   2023-02-12
2   2023-03-14
3   2023-04-10
4   2023-05-16
5   2023-06-21
6   2023-07-25
7   2023-08-17
8   2023-09-10
9   2023-10-05
Name: date_of_admission, dtype: datetime64[ns]

In [43]:
[i for i in dir(students_df['date_of_admission'].dt) if "_" not in i]

['ceil',
 'date',
 'day',
 'dayofweek',
 'dayofyear',
 'daysinmonth',
 'floor',
 'freq',
 'hour',
 'isocalendar',
 'microsecond',
 'minute',
 'month',
 'nanosecond',
 'normalize',
 'quarter',
 'round',
 'second',
 'strftime',
 'time',
 'timetz',
 'tz',
 'unit',
 'weekday',
 'year']

In [45]:
students_df['date_of_admission'].dt.year
students_df['date_of_admission'].dt.month
students_df['date_of_admission'].dt.day
students_df['date_of_admission'].dt.weekday
students_df['date_of_admission'].dt.

0    1
1    6
2    1
3    0
4    1
5    2
6    1
7    3
8    6
9    3
Name: date_of_admission, dtype: int32